app/Controllers/Dashboard.php

    public function index()
    {
        $model = new StudentsModel();
        $role  = session('user_role');

        // RBAC: Student sees only their own record, Faculty sees their mentees
        if ($role === 'student') {
            $student = $model->find(session('student_id'));
            $students = $student ? [$student] : [];
        } elseif ($role === 'faculty') {
            $facultyId = session('user_id');
            $students = $model->select('students.*')
                ->join('mentor_allocation', 'mentor_allocation.student_id = students.id', 'left')
                ->where('mentor_allocation.mentor_id', $facultyId)
                ->findAll();
        } else {
            $students = $model->findAll();
        }

        $db = \Config\Database::connect();

        // Stats based on Role
        if ($role === 'admin') {
            $libStats = [
                'total_books'  => $db->table('books')->countAllResults(),
                'issued_books' => $db->table('book_issue')->where('status', 'Issued')->countAllResults(),
            ];
            $examStats = [
                'pending_results' => $db->table('exam_results')->where('is_published', 0)->countAllResults(),
            ];
            $hostelStats = [
                'total_occupied'   => $db->table('hostel_rooms')->selectSum('occupied')->get()->getRowArray()['occupied'] ?? 0,
                'pending_requests' => $db->table('hostel_allocation')->where('status', 'Pending')->countAllResults(),
---
SELECT *
FROM `students`
WHERE `students`.`id` = '3'
SELECT *
FROM `students`
SELECT COUNT(*) AS `numrows`
FROM `book_issue`
WHERE `status` = 'Issued'
SELECT COUNT(*) AS `numrows`
FROM `exam_results`
WHERE `is_published` = 0
SELECT COUNT(*) AS `numrows`
FROM `hostel_allocation`
WHERE `status` = 'Pending'

            $studentId = session('student_id');
            $libStats = [
                'total_books'  => $db->table('books')->countAllResults(),
                'my_books'     => $db->table('book_issue')->where('student_id', $studentId)->where('status', 'Issued')->countAllResults(),
            ];
            $examStats = [
                'upcoming' => $db->table('exam_schedule')->countAllResults(),
            ];
            $hostel = $db->table('hostel_allocation')
                ->where('student_id', $studentId)
                ->orderBy('id', 'DESC')
                ->get()
                ->getRowArray();
---
SELECT COUNT(*) AS `numrows`
FROM `book_issue`
WHERE `student_id` = '3'
AND `status` = 'Issued'
SELECT COUNT(*) AS `numrows`
FROM `books`
SELECT COUNT(*) AS `numrows`
FROM `exam_schedule`
SELECT *
FROM `hostel_allocation`
WHERE `student_id` = '3'
ORDER BY `id` DESC