app/Controllers/Examination.php

SELECT *
FROM `courses`
SELECT *
FROM `students`
SELECT `exam_schedule`.*, `courses`.`name` as `course_name`
FROM `exam_schedule`
LEFT JOIN `courses` ON `courses`.`id` = `exam_schedule`.`course_id`
ORDER BY `exam_date` ASC
 LIMIT 5
SELECT `exam_results`.*, `students`.`name` as `student_name`, `courses`.`name` as `course_name`
FROM `exam_results`
LEFT JOIN `students` ON `students`.`id` = `exam_results`.`student_id`
LEFT JOIN `courses` ON `courses`.`id` = `exam_results`.`course_id`
WHERE `exam_results`.`student_id` = '3'
AND `is_published` = 1
ORDER BY `exam_results`.`id` DESC
 LIMIT 5
SELECT COUNT(*) AS `numrows`
FROM `exam_schedule`
WHERE `exam_date` >= '2026-04-25'
SELECT COUNT(*) AS `numrows`
FROM `exam_results`
WHERE `is_published` = 0
SELECT COUNT(*) AS `numrows` FROM `exam_schedule`
SELECT COUNT(*) AS `numrows`
FROM `exam_question_papers`
---
    public function index()
    {
        $model = new ExamModel();
        $db    = \Config\Database::connect();
        $courses = $db->table('courses')->get()->getResultArray();
        $students = $db->table('students')->get()->getResultArray();

        // Fetch data for Dashboard Lists
        $recent_schedules = $db->table('exam_schedule')
            ->select('exam_schedule.*, courses.name as course_name')
            ->join('courses', 'courses.id = exam_schedule.course_id', 'left')
            ->orderBy('exam_date', 'ASC')
            ->limit(5)
            ->get()->getResultArray();

        $results_query = $db->table('exam_results')
            ->select('exam_results.*, students.name as student_name, courses.name as course_name')
            ->join('students', 'students.id = exam_results.student_id', 'left')
            ->join('courses', 'courses.id = exam_results.course_id', 'left');

        if (session('user_role') === 'student') {
            $results_query->where('exam_results.student_id', session('student_id'))->where('is_published', 1);
        }
        $recent_results = $results_query->orderBy('exam_results.id', 'DESC')->limit(5)->get()->getResultArray();

        $today = date('Y-m-d');

        return view('examination/index', [
            'title'           => 'Examination Management',
            'total_exams'     => $db->table('exam_schedule')->where('exam_date >=', $today)->countAllResults(),
            'pending_results' => $db->table('exam_results')->where('is_published', 0)->countAllResults(),
            'total_papers'    => $db->table('exam_question_papers')->countAllResults(),