app/Controllers/Hostel.php

SELECT *
FROM `hostel_rooms`
WHERE `occupied` < capacity
---
    public function index()
    {
        $db       = \Config\Database::connect();
        $model    = new HostelModel();
        $role     = session('user_role');

        $data = [
            'title'          => 'Hostel Management',
            'total_rooms'    => $model->countAll(),
            'occupied_rooms' => $model->where('occupied >', 0)->countAll(),
            'requests'       => [],
            'my_allocation'  => null,
            'rooms'          => [],
        ];

        // RBAC: Admin/Faculty see pending requests, active allocations, and all rooms
        if (in_array($role, ['admin', 'faculty'])) {
            $data['requests'] = $db->table('hostel_allocation')
                ->select('hostel_allocation.*, students.name as student_name')
                ->join('students', 'students.id = hostel_allocation.student_id')
                ->where('hostel_allocation.status', 'Pending')
                ->get()->getResultArray();

            $data['active_allocations'] = $db->table('hostel_allocation')
                ->select('hostel_allocation.*, students.name as student_name, hostel_rooms.room_number, hostel_rooms.block')
                ->join('students', 'students.id = hostel_allocation.student_id')
                ->join('hostel_rooms', 'hostel_rooms.id = hostel_allocation.room_id')
                ->where('hostel_allocation.status', 'Active')
                ->get()->getResultArray();

            $data['rooms'] = $model->findAll();

SELECT `hostel_allocation`.*, `hostel_rooms`.`room_number`, `hostel_rooms`.`block`
FROM `hostel_allocation`
LEFT JOIN `hostel_rooms` ON `hostel_rooms`.`id` = `hostel_allocation`.`room_id`
WHERE `hostel_allocation`.`student_id` = '3'
ORDER BY `hostel_allocation`.`id` DESC
---
        // Fetch available rooms for Student to apply
        if ($role === 'student') {
            $data['available_rooms'] = $model->where('occupied < capacity')->findAll();
            $data['my_allocation'] = $db->table('hostel_allocation')
                ->select('hostel_allocation.*, hostel_rooms.room_number, hostel_rooms.block')
                ->join('hostel_rooms', 'hostel_rooms.id = hostel_allocation.room_id', 'left')
                ->where('hostel_allocation.student_id', session('student_id'))
                ->orderBy('hostel_allocation.id', 'DESC')
                ->get()->getRowArray();