app/Controllers/Library.php

    public function index()
    {
        $db        = \Config\Database::connect();
        $model      = new BooksModel();
        $studentModel = new \App\Models\StudentsModel();
        $issueModel = new BookIssueModel();
        $role      = session('user_role');

        $issueLog = [];
        if ($role === 'student') {
            $issueLog = $db->table('book_issue')
                ->select('book_issue.*, books.title, books.author, books.isbn, books.category')
                ->join('books', 'books.id = book_issue.book_id')
                ->where('book_issue.student_id', session('student_id'))
                ->orderBy('book_issue.id', 'DESC')
                ->get()->getResultArray();
        } else {
            $issueLog = $db->table('book_issue')
                ->select('book_issue.*, books.title, books.author, books.isbn, books.category, students.name as student_name')
                ->join('books', 'books.id = book_issue.book_id')
                ->join('students', 'students.id = book_issue.student_id')
                ->orderBy('book_issue.id', 'DESC')
                ->get()->getResultArray();
        }

        // Attach issue history to each book
        $books = $model->findAll();
---
SELECT `book_issue`.*, `books`.`title`, `books`.`author`, `books`.`isbn`, `books`.`category`
FROM `book_issue`
JOIN `books` ON `books`.`id` = `book_issue`.`book_id`
WHERE `book_issue`.`student_id` = '3'
ORDER BY `book_issue`.`id` DESC
SELECT `book_issue`.*, `books`.`title`, `books`.`author`, `books`.`isbn`, `books`.`category`, `students`.`name` as `student_name`
FROM `book_issue`
JOIN `books` ON `books`.`id` = `book_issue`.`book_id`
JOIN `students` ON `students`.`id` = `book_issue`.`student_id`
ORDER BY `book_issue`.`id` DESC
SELECT *
FROM `books`

        return view('library/index', [
            'title'           => 'Library Management',
            'books'           => $books,
            'total_students'  => $studentModel->countAllResults(),
            'total_books'     => $model->countAllResults(),
            'reference_books' => $model->like('category', 'Reference')->countAllResults(),
            'available_books' => $model->where('copies_available >', 0)->countAllResults(),
---
SELECT COUNT(*) AS `numrows`
FROM `students`
SELECT COUNT(*) AS `numrows`
FROM `books`
SELECT COUNT(*) AS `numrows`
FROM `books`
WHERE `category` LIKE '%Reference%' ESCAPE '!'
SELECT COUNT(*) AS `numrows`
FROM `books`
WHERE `copies_available` > 0