app/Controllers/Login.php

SELECT *
FROM `users`
WHERE `username` = 'admin'
---
    public function process()
    {
        $username = $this->request->getPost('username');
        $password = $this->request->getPost('password');
        $captcha  = $this->request->getPost('captcha');

        if ($captcha != session('captcha_result')) {
            return redirect()->back()->with('error', 'Invalid Captcha!');
        }

        $db = \Config\Database::connect();
        $user = $db->table('users')->where('username', $username)->get()->getRowArray();